app/app/controllers/posts_controller.rb

INSERT INTO "posts" ("content", "created_at", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?)  [["content", "asdfsadfsa"], ["created_at", Wed, 07 Nov 2012 20:57:33 UTC +00:00], ["title", "post2"], ["updated_at", Wed, 07 Nov 2012 20:57:33 UTC +00:00], ["user_id", 1]]
---
  def create
    @post = Post.new(params[:post])

	@post.user=current_user

    respond_to do |format|
      if @post.save