app/app/views/ppal/index.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
<% session[:user_id] = @current_user.id
	if(User.find(session[:user_id]))